bench/results/server1/1/apiary-0.15.1/AFTER_DEEP.log
Benchmarking AFTER_DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.80ms   31.51ms 568.09ms   99.66%
    Req/Sec     5.21k     1.26k   14.80k    81.91%
  1188901 requests in 30.00s, 139.46MB read
Requests/sec:  39630.56
Transfer/sec:      4.65MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.51ms   14.42ms 520.81ms   99.82%
    Req/Sec     5.21k     1.30k   14.10k    77.46%
  1196493 requests in 30.00s, 140.35MB read
Requests/sec:  39884.73
Transfer/sec:      4.68MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.33ms   14.92ms 467.07ms   99.87%
    Req/Sec     5.27k     1.22k   12.27k    74.64%
  1212010 requests in 30.00s, 142.17MB read
Requests/sec:  40406.26
Transfer/sec:      4.74MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.84ms    7.10ms 406.18ms   99.83%
    Req/Sec     5.36k     1.26k   12.91k    78.82%
  1225127 requests in 30.00s, 143.71MB read
  Socket errors: connect 0, read 0, write 0, timeout 24
Requests/sec:  40840.83
Transfer/sec:      4.79MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.15ms   11.64ms 393.36ms   99.89%
    Req/Sec     5.28k     1.26k   11.33k    58.90%
  1220217 requests in 30.00s, 143.13MB read
Requests/sec:  40676.26
Transfer/sec:      4.77MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.58ms   36.44ms 558.88ms   99.52%
    Req/Sec     5.20k     1.25k   15.00k    82.22%
  1183592 requests in 30.00s, 138.84MB read
Requests/sec:  39448.81
Transfer/sec:      4.63MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.77ms   14.26ms 556.53ms   99.38%
    Req/Sec     5.10k     1.31k   13.64k    77.68%
  1170690 requests in 30.00s, 137.32MB read
Requests/sec:  39024.18
Transfer/sec:      4.58MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.18ms    6.24ms 311.54ms   99.67%
    Req/Sec     5.20k     1.26k   14.90k    77.41%
  1186318 requests in 29.99s, 139.16MB read
  Socket errors: connect 0, read 0, write 0, timeout 48
Requests/sec:  39556.37
Transfer/sec:      4.64MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.10ms   21.50ms 572.56ms   99.79%
    Req/Sec     5.11k     1.15k   15.00k    78.07%
  1169097 requests in 30.00s, 137.14MB read
Requests/sec:  38964.55
Transfer/sec:      4.57MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.19ms   32.95ms 368.21ms   98.88%
    Req/Sec     5.22k     1.42k   17.10k    82.17%
  1186903 requests in 30.00s, 139.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 106
Requests/sec:  39563.31
Transfer/sec:      4.64MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.15.1
bench:        AFTER_DEEP
bench mode:   30s * 10
average:      39799.59
stdev:        649.20
=================== oneline ===================
7.8.2,apiary-0.15.1,AFTER_DEEP,30s,10,39799.59,649.20