bench/results/server1/1/apiary-0.15.1/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.38ms   12.54ms 564.72ms   99.90%
    Req/Sec     4.67k     1.07k   13.55k    73.71%
  1070653 requests in 30.00s, 124.57MB read
Requests/sec:  35689.57
Transfer/sec:      4.15MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.00ms    5.23ms 352.61ms   97.99%
    Req/Sec     4.70k     1.13k   12.91k    78.69%
  1078539 requests in 30.00s, 125.49MB read
  Socket errors: connect 0, read 0, write 0, timeout 66
Requests/sec:  35951.95
Transfer/sec:      4.18MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.98ms   37.91ms 593.58ms   99.31%
    Req/Sec     4.72k     1.06k   12.44k    86.13%
  1070694 requests in 30.00s, 124.57MB read
Requests/sec:  35690.00
Transfer/sec:      4.15MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.63ms   27.28ms 709.97ms   99.50%
    Req/Sec     4.77k     0.97k   12.11k    89.22%
  1077970 requests in 30.00s, 125.42MB read
Requests/sec:  35927.80
Transfer/sec:      4.18MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.09ms   21.35ms 537.17ms   99.80%
    Req/Sec     4.59k     1.14k    9.13k    62.44%
  1064124 requests in 30.00s, 123.81MB read
Requests/sec:  35467.03
Transfer/sec:      4.13MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.10ms    3.80ms 404.72ms   97.50%
    Req/Sec     4.65k     1.03k   10.08k    70.37%
  1076493 requests in 30.00s, 125.25MB read
Requests/sec:  35881.96
Transfer/sec:      4.17MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.66ms   28.86ms 599.91ms   99.75%
    Req/Sec     4.64k     1.06k   12.33k    78.74%
  1060342 requests in 30.00s, 123.37MB read
Requests/sec:  35341.87
Transfer/sec:      4.11MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.19ms   31.68ms 532.93ms   99.48%
    Req/Sec     4.71k     1.24k   11.46k    80.15%
  1081358 requests in 30.00s, 125.81MB read
Requests/sec:  36043.89
Transfer/sec:      4.19MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.38ms    9.46ms 370.83ms   99.64%
    Req/Sec     4.72k     1.11k   11.83k    72.89%
  1073997 requests in 30.00s, 124.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 50
Requests/sec:  35796.77
Transfer/sec:      4.16MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.05ms   31.58ms 618.18ms   99.54%
    Req/Sec     4.77k     1.02k   14.00k    89.72%
  1076304 requests in 30.00s, 125.23MB read
Requests/sec:  35876.72
Transfer/sec:      4.17MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.15.1
bench:        DEEP
bench mode:   30s * 10
average:      35766.76
stdev:        222.49
=================== oneline ===================
7.8.2,apiary-0.15.1,DEEP,30s,10,35766.76,222.49