bench/results/server1/1/apiary-0.15.1/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.14ms    3.04ms 414.77ms   95.24%
    Req/Sec     3.93k     0.91k    9.38k    67.38%
  903751 requests in 30.00s, 153.42MB read
Requests/sec:  30124.32
Transfer/sec:      5.11MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.68ms   13.94ms 619.56ms   99.81%
    Req/Sec     3.88k     0.99k    9.53k    68.21%
  900525 requests in 30.00s, 152.87MB read
Requests/sec:  30014.02
Transfer/sec:      5.10MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.77ms   39.16ms 595.03ms   99.54%
    Req/Sec     3.97k   812.65     7.69k    84.41%
  907317 requests in 30.00s, 154.02MB read
Requests/sec:  30240.33
Transfer/sec:      5.13MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.61ms   31.00ms 712.33ms   99.65%
    Req/Sec     3.94k   774.13    11.08k    85.89%
  905168 requests in 30.00s, 153.66MB read
  Socket errors: connect 0, read 0, write 0, timeout 18
Requests/sec:  30172.74
Transfer/sec:      5.12MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.44ms    8.12ms 672.34ms   99.54%
    Req/Sec     3.98k   765.80    10.25k    88.06%
  908121 requests in 30.00s, 154.16MB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:  30268.14
Transfer/sec:      5.14MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.37ms    5.95ms 673.40ms   97.86%
    Req/Sec     3.89k   802.24     9.28k    83.00%
  892486 requests in 30.00s, 151.50MB read
Requests/sec:  29751.06
Transfer/sec:      5.05MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.10ms    2.17ms 505.91ms   89.88%
    Req/Sec     3.96k     0.86k   10.07k    81.43%
  906659 requests in 30.00s, 153.91MB read
Requests/sec:  30218.16
Transfer/sec:      5.13MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.21ms   15.50ms 279.83ms   99.63%
    Req/Sec     3.92k   820.86    11.00k    84.84%
  894314 requests in 30.00s, 151.81MB read
Requests/sec:  29807.11
Transfer/sec:      5.06MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.81ms   36.82ms 587.51ms   99.42%
    Req/Sec     3.95k     0.91k   10.92k    82.21%
  907593 requests in 30.01s, 154.07MB read
Requests/sec:  30246.49
Transfer/sec:      5.13MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.69ms   13.84ms 382.22ms   99.83%
    Req/Sec     3.91k     0.96k    8.06k    64.91%
  902702 requests in 30.00s, 153.24MB read
Requests/sec:  30094.78
Transfer/sec:      5.11MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.15.1
bench:        PARAM
bench mode:   30s * 10
average:      30093.72
stdev:        183.74
=================== oneline ===================
7.8.2,apiary-0.15.1,PARAM,30s,10,30093.72,183.74